"""
Задание 5. Пользователь вводит строку из нескольких слов,
разделённых пробелами. Вывести каждое слово с новой строки.
Строки необходимо пронумеровать. Если слово длинное,
выводить только первые 10 букв в слове.

Пример:
Введите слова через пробел: раз два три
1. раз
2. два
3. три

Введите слова через пробел: раз перерефрижерированность
1. раз
2. перерефриж
"""
line_word = input("Enter line: ").split(" ")
for i, elem in enumerate(line_word, 1):
    if len(elem) > 10:
        elem = elem[0:10]
    print(f"{i}. {elem}")
